#### ApplicationEntryPoint Members

---

|  |
| --- |
| ApplicationEntryPoint Class   Constructors   Methods   Properties   Events   See Also |

The  ApplicationEntryPoint  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ApplicationEntryPoint | Initializes a new instance of the  ApplicationEntryPoint  class |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | CopyModel | Copies an existing model to a new file. Overwriting a file of the same name is allowed. (Inherited from  Application  .) |
| Public method | Dispose | (Inherited from  Application  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | ExtractPartAtomFromFamilyFile | Writes a PartAtom XML from the contents of a family file. (Inherited from  Application  .) |
| Public method | FinishInitializationEO | For Revit Macros internal use only. |
| Public method | GetAssets | Gets all the Assets of the specified type. (Inherited from  Application  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetLibraryPaths | Returns path information identifying where Revit searches for content. (Inherited from  Application  .) |
| Public method | GetRevitServerNetworkHosts | Gets the list of all Revit Server Network hosts in current session. (Inherited from  Application  .) |
| Public method | GetSystemsAnalysisWorkflowNames | Returns names for systems analysis workflows. (Inherited from  Application  .) |
| Public method | GetSystemsAnalysisWorkflows | Returns name and path information identifying systems analysis workflow files. (Inherited from  Application  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | GetWorksharingCentralGUID | Gets the worksharing central GUID of the given server-based model. (Inherited from  Application  .) |
| Public method | Initialize | For Revit Macros internal use only. |
| Public method | IsJournalPlaying | Determines if the application is currently in journal playback mode. (Inherited from  Application  .) |
| Public method | NewFamilyDocument | New family document, including family, titleblock, and annotation symbol (Inherited from  Application  .) |
| Public method | NewProjectDocument(String) | New project document (Inherited from  Application  .) |
| Public method | NewProjectDocument(UnitSystem) | Creates a new project document with no template file specified. (Inherited from  Application  .) |
| Public method | NewProjectTemplateDocument | New project template document (Inherited from  Application  .) |
| Public method | OnShutdownEO | For Revit Macros internal use only. |
| Public method | OpenBuildingComponentDocument | Opens a Building Component document from disk. (Inherited from  Application  .) |
| Public method | OpenDocumentFile(String) | Opens a document from disk. (Inherited from  Application  .) |
| Public method | OpenDocumentFile(ModelPath, OpenOptions) | Opens a document from disk or cloud. (Inherited from  Application  .) |
| Public method | OpenDocumentFile(ModelPath, OpenOptions, IOpenFromCloudCallback) | Opens a document from disk or cloud. (Inherited from  Application  .) |
| Public method | OpenIFCDocument(String) | Opens an IFC document from disk using default options. (Inherited from  Application  .) |
| Public method | OpenIFCDocument(String, IFCImportOptions) | Opens an IFC document from disk using custom options. (Inherited from  Application  .) |
| Public method | OpenSharedParameterFile | Enables access to shared parameter groups and definitions that are maintained on disk. (Inherited from  Application  .) |
| Public method | PurgeReleasedAPIObjects | Explicitly purges all API objects that have been released but are still awaiting to be finalized (Inherited from  Application  .) |
| Public method | SetLibraryPaths | Sets path information identifying where Revit searches for content. (Inherited from  Application  .) |
| Public method | SetSystemsAnalysisWorkflows | Sets name and path information identifying systems analysis workflow files. (Inherited from  Application  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |
| Public method | UpdateRenderAppearanceLibrary | Updates the stored render appearance library, giving the Revit session access to any new RPC content. (Inherited from  Application  .) |
| Public method | WriteJournalComment | Writes a comment to the Revit journal file. (Inherited from  Application  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ActiveAddInId | Retrieves the Id of the currently running external application. (Inherited from  Application  .) |
| Public property | AddinFolder | The full path to the Revit Macros module. |
| Public property | AllowNavigationDuringRedraw | Checks whether or not the navigation during redraw is enabled, and enable or disable it. (Inherited from  Application  .) |
| Public property | AllUsersAddinsLocation | The folder location for .addin files for all users. (Inherited from  Application  .) |
| Public property | AngleTolerance | Angle tolerance. (Inherited from  Application  .) |
| Public property | BackgroundColor | The background color to use for model views in this session. (Inherited from  Application  .) |
| Public property | Cities | Returns a set of all the known city locations within Revit. (Inherited from  Application  .) |
| Public property | Create | Provides an object that can be used to create new instances of Autodesk Revit API objects. (Inherited from  Application  .) |
| Public property | CurrentRevitServerAccelerator | Current Revit Server accelerator. (Inherited from  Application  .) |
| Public property | CurrentUserAddinsLocation | The folder location for .addin files for the current user. (Inherited from  Application  .) |
| Public property | CurrentUsersAddinsDataFolderPath | Path to AddinsData folder for the current user. (Inherited from  Application  .) |
| Public property | CurrentUsersDataFolderPath | Path to data folder for the current user. (Inherited from  Application  .) |
| Public property | DefaultIFCProjectTemplate | Full path to the default template file for new IFC project documents. It may be empty, in which case the DefaultProjectTemplate should be used. (Inherited from  Application  .) |
| Public property | DefaultProjectTemplate | Full path to the default template file for new project documents. (Inherited from  Application  .) |
| Public property | DefaultViewDiscipline | The view discipline that will be applied to new views by default. (Inherited from  Application  .) |
| Public property | Documents | Returns a set of documents within Revit. (Inherited from  Application  .) |
| Public property | ExportIFCCategoryTable | Full path to the file that defines Revit category to IFC entity mappings for IFC export. (Inherited from  Application  .) |
| Public property | FamilyTemplatePath | Default path for family template files. (Inherited from  Application  .) |
| Public property | ImportIFCCategoryTable | Full path to the file that defines IFC entity to Revit category mappings for IFC import. (Inherited from  Application  .) |
| Public property | IsArchitectureEnabled | Checks whether or not the architecture discipline is enabled, and enable or disable it. (Inherited from  Application  .) |
| Public property | IsElectricalAnalysisEnabled | Checks whether or not electrical analysis is enabled, and enable or disable it. (Inherited from  Application  .) |
| Public property | IsElectricalEnabled | Checks whether or not the electrical discipline is enabled, and enable or disable it. (Inherited from  Application  .) |
| Public property | IsEnergyAnalysisEnabled | Checks whether or not energy analysis is enabled, and enable or disable it. (Inherited from  Application  .) |
| Public property | IsInfrastructureEnabled | Checks whether or not infrastructure discipline is enabled, and enable or disable it. (Inherited from  Application  .) |
| Public property | IsMassingEnabled | Checks whether or not the massing and site tools are enabled, and enable or disable them. (Inherited from  Application  .) |
| Public property | IsMechanicalAnalysisEnabled | Checks whether or not mechanical analysis is enabled, and enable or disable it. (Inherited from  Application  .) |
| Public property | IsMechanicalEnabled | Checks whether or not the mechanical discipline is enabled, and enable or disable it. (Inherited from  Application  .) |
| Public property | IsPipingAnalysisEnabled | Checks whether or not piping analysis is enabled, and enable or disable it. (Inherited from  Application  .) |
| Public property | IsPipingEnabled | Checks whether or not the piping discipline is enabled, and enable or disable it. (Inherited from  Application  .) |
| Public property | IsRouteAnalysisEnabled | Checks whether or not route analysis is enabled, and enable or disable it. (Inherited from  Application  .) |
| Public property | IsStructuralAnalysisEnabled | Checks whether or not the structural analysis is enabled, and enable or disable it. (Inherited from  Application  .) |
| Public property | IsStructureEnabled | Checks whether or not the structure discipline is enabled, and enable or disable it. (Inherited from  Application  .) |
| Public property | IsSystemsEnabled | Checks whether or not any systems disciplines (mechanical, electrical, or piping) are enabled. (Inherited from  Application  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  Application  .) |
| Public property | Language | The language used in the current session of Revit. (Inherited from  Application  .) |
| Public property | LoginUserId | The user id of the user currently logged in. The user id will be empty if the user is not logged in. (Inherited from  Application  .) |
| Public property | PointCloudsRootPath | Root path for point cloud files. (Inherited from  Application  .) |
| Public property | Product | The product type for the current session of Revit. (Inherited from  Application  .) |
| Public property | RecordingJournalFilename | Retrieve the name of the journal file the Revit is currently recording to. (Inherited from  Application  .) |
| Public property | SharedParametersFilename | Contains the fully qualified path to a shared parameters file. (Inherited from  Application  .) |
| Public property | ShortCurveTolerance | The enforced minimum length for any curve created by Revit. (Inherited from  Application  .) |
| Public property | ShowGraphicalOpenEndsAreaBasedLoadBoundaryDisconnects | Whether or not to show the graphical open ends for Area Based Load Boundary disconnects. (Inherited from  Application  .) |
| Public property | ShowGraphicalWarningCableTrayConduitDisconnects | Whether or not to show the graphical warnings for CTC disconnects. (Inherited from  Application  .) |
| Public property | ShowGraphicalWarningDuctDisconnects | Whether or not to show the graphical warnings for duct disconnects. (Inherited from  Application  .) |
| Public property | ShowGraphicalWarningElectricalDisconnects | Whether or not to show the graphical warnings for Electrical disconnects. (Inherited from  Application  .) |
| Public property | ShowGraphicalWarningHangerDisconnects | Whether or not to show the graphical warnings for Fabrication Hanger disconnects. (Inherited from  Application  .) |
| Public property | ShowGraphicalWarningPipeDisconnects | Whether or not to show the graphical warnings for Pipe disconnects. (Inherited from  Application  .) |
| Public property | SubVersionNumber | The minor version number of Revit (Inherited from  Application  .) |
| Public property | SystemsAnalysisWorkfilesRootPath | Root path for systems analysis workfiles (Inherited from  Application  .) |
| Public property | Username | Gets the user name for the current Revit session. (Inherited from  Application  .) |
| Public property | VersionBuild | Returns the internal build number of the Autodesk Revit application. (Inherited from  Application  .) |
| Public property | VersionName | Returns the name of the Revit application. (Inherited from  Application  .) |
| Public property | VersionNumber | Return the primary version of the Revit application. (Inherited from  Application  .) |
| Public property | VertexTolerance | Vertex tolerance. (Inherited from  Application  .) |

# Events

|  | Name | Description |
| --- | --- | --- |
| Public event | ApplicationInitialized | Subscribe to this event to get notified after the Revit application has been initialized (Inherited from  Application  .) |
| Public event | DocumentChanged | Subscribe to the DocumentChanged event to be notified when Revit document has changed. (Inherited from  Application  .) |
| Public event | DocumentClosed | Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document. (Inherited from  Application  .) |
| Public event | DocumentClosing | Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document. (Inherited from  Application  .) |
| Public event | DocumentCreated | Subscribe to the DocumentCreated event to be notified immediately after Revit has finished creating a new document. (Inherited from  Application  .) |
| Public event | DocumentCreating | Subscribe to the DocumentCreating event to be notified when Revit is just about to create a new document. (Inherited from  Application  .) |
| Public event | DocumentOpened | Subscribe to the DocumentOpened event to be notified immediately after Revit has finished opening a document. (Inherited from  Application  .) |
| Public event | DocumentOpening | Subscribe to the DocumentOpening event to be notified when Revit is just about to open a document. (Inherited from  Application  .) |
| Public event | DocumentPrinted | Subscribe to the DocumentPrinted event to be notified immediately after Revit has finished printing a view or ViewSet of the document. (Inherited from  Application  .) |
| Public event | DocumentPrinting | Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document. (Inherited from  Application  .) |
| Public event | DocumentReloadedLatest | Subscribe to the DocumentReloadedLatestEventArgs event to be notified immediately after Revit has finished reloading a document with central model. (Inherited from  Application  .) |
| Public event | DocumentReloadingLatest | Subscribe to the DocumentReloadingLatestEventArgs event to be notified when Revit is just about to reload latest changes from a central model. (Inherited from  Application  .) |
| Public event | DocumentSaved | Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document. (Inherited from  Application  .) |
| Public event | DocumentSavedAs | Subscribe to the DocumentSavedAs event to be notified immediately after Revit has finished saving document with a new file name. (Inherited from  Application  .) |
| Public event | DocumentSaving | Subscribe to the DocumentSaving event to be notified when Revit is just about to save a document. (Inherited from  Application  .) |
| Public event | DocumentSavingAs | Subscribe to the DocumentSavingAs event to be notified when Revit is just about to save the document with a new file name. (Inherited from  Application  .) |
| Public event | DocumentSynchronizedWithCentral | Subscribe to the DocumentSynchronizedWithCentral event to be notified immediately after Revit has finished synchronizing a document with central model. (Inherited from  Application  .) |
| Public event | DocumentSynchronizingWithCentral | Subscribe to the DocumentSynchronizingWithCentral event to be notified when Revit is just about to synchronize a document with central model. (Inherited from  Application  .) |
| Public event | DocumentWorksharingEnabled | Subscribe to the DocumentWorksharingEnabled event to be notified when a document has become workshared. (Inherited from  Application  .) |
| Public event | ElementTypeDuplicated | Subscribe to the ElementTypeDuplicated event to be notified immediately after Revit has finished duplicating an element type. (Inherited from  Application  .) |
| Public event | ElementTypeDuplicating | Subscribe to the ElementTypeDuplicating event to be notified when Revit is just about to duplicate an element type. (Inherited from  Application  .) |
| Public event | FailuresProcessing | Subscribe to the FailuresProcessing event to be notified when failures are being processed at the end of transaction. (Inherited from  Application  .) |
| Public event | FamilyLoadedIntoDocument | Subscribe to the FamilyLoadedInto event to be notified after Revit loaded a family into a document. (Inherited from  Application  .) |
| Public event | FamilyLoadingIntoDocument | Subscribe to the FamilyLoadingInto event to be notified when Revit is just about to load a family into a document. (Inherited from  Application  .) |
| Public event | FileExported | Subscribe to the FileExported event to be notified immediately after Revit has finished exporting files of formats supported by the API. (Inherited from  Application  .) |
| Public event | FileExporting | Subscribe to the FileExporting event to be notified when Revit is just about to export files of formats supported by the API. (Inherited from  Application  .) |
| Public event | FileImported | Subscribe to the FileImported event to be notified immediately after Revit has finished importing a file of format supported by the API. (Inherited from  Application  .) |
| Public event | FileImporting | Subscribe to the FileImporting event to be notified when Revit is just about to import a file of format supported by the API. (Inherited from  Application  .) |
| Public event | LinkedResourceOpened | Subscribe to the LinkedResourceOpened event to be notified immediately after Revit has finished opening a linked resource. (Inherited from  Application  .) |
| Public event | LinkedResourceOpening | Subscribe to the LinkedResourceOpening event to be notified when Revit is just about to open a linked resource. (Inherited from  Application  .) |
| Public event | ProgressChanged | Subscribe to the ProgressChanged event to be notified when an operation in Revit has progress bar data available. (Inherited from  Application  .) |
| Public event | ViewExported | Subscribe to the ViewExported event to be notified immediately after Revit has finished exporting a view of the document. (Inherited from  Application  .) |
| Public event | ViewExporting | Subscribe to the ViewExporting event to be notified when Revit is just about to export a view of the document. (Inherited from  Application  .) |
| Public event | ViewPrinted | Subscribe to the ViewPrinted event to be notified immediately after Revit has finished printing a view of the document. (Inherited from  Application  .) |
| Public event | ViewPrinting | Subscribe to the ViewPrinting event to be notified when Revit is just about to print a view of the document. (Inherited from  Application  .) |
| Public event | ViewsExportedByContext | Subscribe to the ViewsExportedByContext event to be notified immediately after Revit has finished exporting one or more views of the document via an export context by CustomExporter. (Inherited from  Application  .) |
| Public event | ViewsExportingByContext | Subscribe to the ViewsExportingByContext event to be notified when Revit is just about to export one or more views of the document via an export context by CustomExporter. (Inherited from  Application  .) |
| Public event | WorksharedOperationProgressChanged | Subscribe to the WorksharedOperationProgressChanged to be notified when progress has changed during Collaboration for Revit's workshared operations: open model and synchronize with central. (Inherited from  Application  .) |

# See Also

ApplicationEntryPoint Class

Autodesk.Revit.DB.Macros Namespace